Chapters/Chapter_4/2_moorDyn_H12T18_boxPositionAdjusted/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(inlet|outlet|front|back|bottom|atmosphere)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    Floater
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
