Chapters/Chapter_4/2_moorDyn_H12T18_boxPositionAdjusted/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet_relaxation_length 3.57;

outlet_relaxation_length 7.14;

water_depth         0.5;

tank_length         7;

domain_length       17.71;

domain_width        1;

domain_height       0.46;

wave_period         1.8;

rel_depth           0.140056;

steepness           0.0336134;

wave_length         3.57;

wave_height         0.12;

CPH                 10;

aspect_ratio        1;

ref_level           2;

x1                  -7.07;

x2                  10.64;

y1                  -0.5;

y2                  0.5;

z1                  -0.5;

z2                  0.46;

seaLevel            0;

relaxationNames     ( inlet outlet );

initializationName  inlet;

inletCoeffs
{
    waveType            stokesSecond;
    Tsoft               0;
    depth               0.5;
    period              1.8;
    direction           ( 1 0 0 );
    phi                 0;
    height              0.12;
    waveNumber          (1.75892865844 0 0);
    omega               3.49065850399;
    debug               false;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( -7.07 0 -0.5 );
        endX                ( -3.5 0 0.46 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               0.1;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 3.5 0 -0.5 );
        endX                ( 10.64 0 0.46 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
