Chapters/Chapter_4/2_moorDyn_H12T18_boxPositionAdjusted/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//User-defined parameters
#include "../myVars" //Include global variables

// Start wavesProperties.input
seaLevel	0;
//seaLevelAsReference true;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet outlet);

initializationName inlet;

inletCoeffs
{
    waveType    stokesSecond;//potentialCurrent Current which is uniform over the depth
    //U         (0 0 0);
    Tsoft       0;
    depth       $water_depth;
    period      $wave_period;
    phi         0.000000;
    direction  (1.0 0.0 0.0);
    height      $wave_height;
    debug       false;

    /*waveType    potentialCurrent; // Current which is uniform over the depth
    U           (0 0 0);
    Tsoft       0.1;
    */

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   INLET;
        startX      ($x1 0 $z1);
        endX        (#calc "$x1+$inlet_relaxation_length" 0 $z2);
        orientation      (1.0 0.0 0.0);
        // By default, an exponential relaxation weight is used, see Manual page 19 for other options
    }
};

outletCoeffs
{
    waveType    potentialCurrent; // Current which is uniform over the depth
    U           (0 0 0);
    Tsoft       0.1;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   OUTLET;
        startX      (#calc "$x2-$outlet_relaxation_length" 0 $z1);
        endX        ($x2 0 $z2);
        orientation      (1.0 0.0 0.0);
    }
};

// ************************************************************************* //
